app/Http/Controllers/UsersController.php

    public function store(Request $request)
    {
        $data = $request->except(['_token']);
        $data['password'] = Hash::make($data['password']);
        $user = User::create($data);
---
insert into "users" ("name", "email", "password", "updated_at", "created_at") values ('teste', 'teste@teste.com', '$2y$10$VwH97hFIndV8hV5frVVaNefzAxJoBg38Pgtd4pi9fHA1gdvTQevum', '2023-08-24 17:41:11', '2023-08-24 17:41:11')